Repository: AptimiCt/ios-diplom
Catalog: Navigation/SupportingFiles/*.lproj/Localizable.strings
Languages: ru

# fvcTitle
source: Documents
ru: Документы

# incorrectCredentials
source: The password or email does not match. Enter the correct data.
ru: Пароль или email не совпадают. Введите корректные данные.

# emptyEmail
source: The login cannot be empty.
ru: Логин не может быть пустым.

# emptyPassword
source: The password cannot be empty.
ru: Пароль не может быть пустым.

# invalidEmail
source: Please use a valid email address as your login.
ru: Пожалуйста, используйте действительный email-адрес в качестве логина.

# userNotFound
source: There is no such user. Register a user.
ru: Отсутсвует такой пользователь. Зарегистрируйте пользователя.

# userDisabled
source: User is disabled.
ru: Пользователь отключен.

# loginInUse
source: The user with this email already exists.
ru: Пользователь с таким адресом уже зарегистрирован, пожалуйста, выберете другой адрес.

# weakPassword
source: You entered a password that is too weak.
ru: Вы ввели слишком ненадёжный пароль.

# weakPasswordExtend
source: The password does not meet the requirements. Enter 8 characters or more, capital and small letters and symbols.
ru: Пароль не соответствует требованиям. Введите от 8 символов, большие и маленькие буквы и символы.

# networkError
source: Problem with the Internet connection. Try again.
ru: Проблема с подключением к Интернету. Попробуйте ещё раз.

# tooManyRequests
source: Too many authentication requests have been received from your device. Please try again in 10 minutes.
ru: С вашего устройства поступило слишком много запросов аутентификации. Пожалуйста, повторите попытку через 10 минут.

# AuthenticationError.unknown
source: An unknown error has occurred.
ru: Произошла неизвестная ошибка.

# photosLabel.text
source: Photos
ru: Фотографии

# friendsLabel.text
source: Friends
ru: Друзья

source: Photo Gallery
ru: Галерея фото

# firstPost.author
source: Antilles (also Caribbean or Caribbean Islands)
ru: Анти́льские острова́ (также Карибы или Карибские острова)

# firstPost.description
source: The Antilles (also known as the Caribbean Islands or Carib Islands) are islands in the Caribbean Sea and the Gulf of Mexico that lie between North America and South America. Together they form an area of 228,662 square kilometers with a population of approximately 42 million (at the beginning of the 21st century). The name "Antilles" first occurs in 1493 by Peter Martyr d'Anguiere, a contemporary of Christopher Columbus, courtier to Ferdinand of Aragon and Isabella of Castile. Presumably, they were named after the semi-mythical island or archipelago of Antilia, depicted on medieval maps.
ru: Анти́льские острова́ (также Карибы или Карибские острова) — острова в Карибском море и Мексиканском заливе, расположенные между Северной Америкой и Южной Америкой. Вместе взятые, образуют площадь в 228 662 км² с населением примерно 42 млн чел. (на начало XXI века). Впервые название «Антильские» встречается в 1493 году у Петра Мартира д’Ангиера, современника Христофора Колумба, придворного Фердинанда Арагонского и Изабеллы Кастильской. Предположительно, были названы по полумифическому острову или архипелагу Антилия, изображавшемуся на средневековых картах.

# secondPost.author
source: The urbis, or snow bar
ru: И́рбис, или сне́жный бар

# secondPost.description
source: The urbis, or snow leopard, or snow leopard (Latin: Panthera uncia, formerly Latin: Uncia uncia) is a large predatory mammal of the feline family that inhabits the mountains of Central Asia. The irbis is distinguished by its thin, long, flexible body, relatively short legs, small head and very long tail. Together with the tail, it reaches a length of 200-230 cm and weighs up to 55 kg. The fur coloration is light smoky-gray, with ring-shaped and solid dark spots. Nowadays the number of irbis is catastrophically low - the population of the species in 2003 according to different estimations was from 4 to 7 thousand individuals, in 2020 from 2,7 to 3,4 thousand. In the 20th century it was included in the IUCN Red List, in the Red Book of Russia, as well as in the protection documents of other countries. Hunting the snow leopard is prohibited in all countries where it inhabits, the snow leopard is also included in Appendix I of the CITES Convention (an international ban on trade in endangered species and their parts). Since 2013, 12 countries, where the snow leopard inhabits, have adopted a "Global program for the conservation of the snow leopard and its ecosystems", which provides for special measures for its conservation (anti-poaching, creation of special protected areas, subsidies for farmers in case of loss of livestock from the snow leopard, etc.).
ru: И́рбис, или сне́жный барс, или снежный леопард (лат. Panthera uncia, ранее — лат. Uncia uncia) — крупное хищное млекопитающее семейства кошачьих, обитающее в горах Центральной Азии. Ирбис отличается тонким, длинным, гибким телом, относительно короткими лапами, небольшой головой и очень длинным хвостом. Достигая вместе с хвостом длины 200—230 см, имеет массу до 55 кг. Окраска меха светлая дымчато-серая с кольцеобразными и сплошными тёмными пятнами. В силу труднодоступности местообитания и низкой плотности вида до сих пор остаются малоисследованными многие аспекты его биологии.В настоящее время численность ирбисов катастрофически мала — популяция вида в 2003 году по различным оценкам составляла от 4 до 7 тысяч особей, в 2020 году от 2,7 до 3,4 тысяч. В XX веке он был внесён в Красную книгу МСОП, в Красную книгу России, а также в охранные документы других стран. Охота на снежного барса запрещена во всех странах, где он обитает, снежный барс также внесён в приложение I Конвенции CITES (международный запрет на торговлю исчезающими видами животных и их частями). С 2013 года 12 странами, где обитает снежный барс, принята «Глобальная программа по сохранению снежного барса и его экосистем», предусматривающая специальные меры по его сохранению (борьба с браконьерством, создание особо охраняемых природных территорий, субсидирование фермеров в случае потери домашнего скота от снежного барса и т. д.).

# thirdPost.author
source: Baikal (bir. Baigal Dalai)
ru: Байка́л (бур. Байгал далай)

# thirdPost.description
source: Baikal (bir. Baigal Dalai) is a lake of tectonic origin in the southern part of Eastern Siberia, the deepest lake on the planet, the largest natural reservoir of fresh water and the largest freshwater lake on the continent in terms of area. The lake and coastal areas are characterized by a unique diversity of flora and fauna, most of the animal species are endemic.
ru: Байка́л (бур. Байгал далай) — озеро тектонического происхождения в южной части Восточной Сибири, самое глубокое озеро на планете, крупнейший природный резервуар пресной воды и самое большое по площади пресноводное озеро на континенте. Озеро и прибрежные территории отличаются уникальным разнообразием флоры и фауны, бо́льшая часть видов животных эндемична.

# fourthPost.author
source: Holiday fireworks
ru: Пра́здничный салю́т

# fourthPost.description
source: The fireworks display is a state event on especially solemn holidays and events; it consists of a massive fireworks display accompanied by several artillery volleys. Fireworks are carried out from one or more launching sites, cordoned off for the duration of the event, with the closure (if necessary) of adjacent streets.
ru: Пра́здничный салю́т — государственное мероприятие по особо торжественным праздникам и событиям; заключается в массированном фейерверке в сопровождении нескольких артиллерийских залпов. Фейерверк проводится с одной или нескольких стартовых площадок, оцепляемых на период проведения, с перекрытием (в случае необходимости) прилегающих улиц.

# alertButton.title
source: Alert
ru: Оповещение

# alertButton.action.title
source: Notification
ru: Уведомление

# alertButton.action.message
source: Button pressed in InfoViewController
ru: Нажата кнопка в InfoViewController

# alertButton.action.cancel.pressed
source: "Cancel" button is pressed
ru: Нажата кнопка "Отмена"

# alertButton.action.ok.pressed
source: The "OK" button is pressed
ru: Нажата кнопка "Хорошо"

# navigationItemFeed.title
source: Feed
ru: Новости

# firstButton.title
source: First button
ru: Первая кнопка

# files.title
source: Files
ru: Файлы

# checkWordButton.title
source: Check the word
ru: Проверить слово

# wordTextField.placeholder
source: Enter a word to check
ru: Введите слово для проверки

# checkWordButton.true
source: Right.
ru: Верно.

# checkWordButton.false
source: Wrong.
ru: Не верно.

# tabBarItemProfileView.title
source: Profile
ru: Профиль

# editProfileButton.title
source: Edit profile
ru: Редактировать профиль

# findFriendsButton.title
source: Find friends
ru: Поиск друзей

# addPost.title
source: Add post
ru: Добавить запись

# addPhoto.title
source: Add photo
ru: Добавить фото

# statusLabel.text
source: Waiting for something...
ru: Ожидание чего-то...

# loginTextView.placeholder
source: Email
ru: Электронная почта

# passwordTextView.placeholder
source: Password
ru: Пароль

# loginButton.title
source: LogIn
ru: Вход

# signUpButton.title
source: SignUp
ru: Регистрация

# biometryButton.title
source: Login with biometrics
ru: Вход по биометрии

# choosePasswordButton.title
source: Pick up password
ru: Подобрать пароль

# tabBarItemLoginVC.title
source: Profile
ru: Профиль

# alertForError.title
source: Input error.
ru: Ошибка ввода.

# testUserService.fullName
source: Master Chief
ru: Мастер Чиф

# currentUserService.fullName
source: Jake Sully
ru: Джейк Салли

# tabBarItemFavoritesView.title
source: Favorites
ru: Избранное

# applyFilter.alertController.title
source: Enter the author
ru: Введите автора

# applyFilter.alertController.okAction
source: Apply
ru: Применить

# tabBarItemMap.title
source: Map
ru: Карта

# UIPV.tappedButton.new
source: Add data
ru: Добавить данные

# UIPV.tappedButton.update
source: Update data
ru: Обновить данные

# sceneDelegate.post
source: Post
ru: Публикация

# LocalAuthorizationService.localizedReason
source: Access to the Navigation app
ru: Доступ в приложение Navigation

# LocalAuthorizationService.authenticationFailed
source: There was a problem verifying your identity.
ru: Возникла проблема с проверкой вашей личности.

# LocalAuthorizationService.userCancel
source: You pressed cancel.
ru: Вы нажали отмену.

# LocalAuthorizationService.userFallback
source: You pressed password.
ru: Вы нажали пароль.

# LocalAuthorizationService.biometryNotAvailable
source: Face ID/Touch ID is not available.
ru: Функция Face ID/Touch ID недоступна.

# LocalAuthorizationService.biometryNotEnrolled
source: Face ID/Touch ID is not set up.
ru: Face ID/Touch ID не настроен.

# LocalAuthorizationService.biometryLockout
source: Face ID/Touch ID is locked.
ru: Face ID/Touch ID заблокирован.

# LocalAuthorizationService.unknown
source: Face ID/Touch ID may not be configured
ru: Face ID/Touch ID могут быть не настроены

# LocalNotificationsService.actionCheck.title
source: Check
ru: Проверить

# LocalNotificationsService.content.title
source: Update
ru: Обновления

# LocalNotificationsService.content.body
source: Look for the latest updates
ru: Посмотрите последние обновления

# LocalNotificationsService.delegate.didReceive
source: Unknown button pressed
ru: Нажата неизвестная кнопка

# UIAC.ok
source: Ok
ru: Хорошо

# UIAC.cancel
source: Cancel
ru: Отменить
